#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = (known after apply)
      + tags     = (known after apply)
    }

  # azurerm_resource_group.example_dr will be created
  + resource "azurerm_resource_group" "example_dr" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = (known after apply)
      + tags     = (known after apply)
    }

  # azurerm_sql_database.example will be created
  + resource "azurerm_sql_database" "example" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "northeurope"
      + max_size_bytes                   = (known after apply)
      + name                             = (known after apply)
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = (known after apply)
      + restore_point_in_time            = (known after apply)
      + server_name                      = (known after apply)
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "sandbox"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # azurerm_sql_database.example_dr will be created
  + resource "azurerm_sql_database" "example_dr" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westeurope"
      + max_size_bytes                   = (known after apply)
      + name                             = (known after apply)
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = (known after apply)
      + restore_point_in_time            = (known after apply)
      + server_name                      = (known after apply)
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "sandbox"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # azurerm_sql_elasticpool.example will be created
  + resource "azurerm_sql_elasticpool" "example" {
      + creation_date       = (known after apply)
      + db_dtu_max          = 5
      + db_dtu_min          = 0
      + dtu                 = 50
      + edition             = "Basic"
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = (known after apply)
      + pool_size           = 5000
      + resource_group_name = (known after apply)
      + server_name         = (known after apply)
      + tags                = (known after apply)
    }

  # azurerm_sql_elasticpool.example_dr will be created
  + resource "azurerm_sql_elasticpool" "example_dr" {
      + creation_date       = (known after apply)
      + db_dtu_max          = 5
      + db_dtu_min          = 0
      + dtu                 = 50
      + edition             = "Basic"
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + pool_size           = 5000
      + resource_group_name = (known after apply)
      + server_name         = (known after apply)
      + tags                = (known after apply)
    }

  # azurerm_sql_server.example will be created
  + resource "azurerm_sql_server" "example" {
      + administrator_login          = "4dm1n157r470r"
      + administrator_login_password = (sensitive value)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "northeurope"
      + name                         = (known after apply)
      + resource_group_name          = (known after apply)
      + tags                         = (known after apply)
      + version                      = "12.0"
    }

  # azurerm_sql_server.example_dr will be created
  + resource "azurerm_sql_server" "example_dr" {
      + administrator_login          = "4dm1n157r470r"
      + administrator_login_password = (sensitive value)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westeurope"
      + name                         = (known after apply)
      + resource_group_name          = (known after apply)
      + tags                         = (known after apply)
      + version                      = "12.0"
    }

  # random_string.example will be created
  + resource "random_string" "example" {
      + id          = (known after apply)
      + length      = 6
      + lower       = false
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.random_dr will be created
  + resource "random_string" "random_dr" {
      + id          = (known after apply)
      + length      = 6
      + lower       = false
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions8`, Working Directory: `elastic_pool`*
